/*
Задача 100.
Написать запрос, который выводит все операции прихода и расхода из таблиц Income и Outcome в следующем виде:
дата, порядковый номер записи за эту дату, пункт прихода, сумма прихода, пункт расхода, сумма расхода.
При этом все операции прихода по всем пунктам, совершённые в течение одного дня, упорядочены по полю code,
и так же все операции расхода упорядочены по полю code.
В случае, если операций прихода/расхода за один день было не равное количество,
выводить NULL в соответствующих колонках на месте недостающих операций.
 */

USE recycling_inc;

SELECT A.date, A.number, B.point, B.inc, C.point, C.out
-- оконная функция вывода даты с нумерацией секции по дате из таблицы Income;
FROM (SELECT DISTINCT date, ROW_Number() OVER
    (PARTITION BY date ORDER BY code asc) AS number
      FROM Income
      -- объединение данных данных двух оконных функций;
      UNION
      -- оконная функция вывода даты с нумерацией секции по дате из таблицы Outcome;
      SELECT DISTINCT date, ROW_Number() OVER
          (PARTITION BY date ORDER BY code asc)
      FROM Outcome) A
 -- соединение таблицы левой частью (объединенной оконной функции) с полями таблицы Income;
 LEFT Join (SELECT date, point, inc, ROW_Number() OVER
     (PARTITION BY date ORDER BY code asc) AS number
      FROM Income) B
     -- параметры соединения;
     ON B.date = A.date AND B.number = A.number
 -- соединение таблицы левой частью (объединенной оконной функции) с полями таблицы Outcome;
 LEFT Join (SELECT date, point, out, ROW_Number() OVER
     (PARTITION BY date ORDER BY code asc) AS number
      FROM Outcome) C
     -- параметры соединения.
     ON C.date = A.date AND C.number = A.number
GO
+------------+--------+---------+------------+---------+------------+
|    date    | number | B.point |    inc     | C.point |    out     |
+------------+--------+---------+------------+---------+------------+
| 2001-03-14 |   1    |   NULL  |    NULL    |    1    | 15348.0000 |
| 2001-03-22 |   1    |    1    | 15000.0000 |    2    |  1440.0000 |
| 2001-03-22 |   2    |    2    | 10000.0000 |    2    |  1440.0000 |
| 2001-03-22 |   3    |    1    | 15000.0000 |   NULL  |    NULL    |
| 2001-03-23 |   1    |    1    | 15000.0000 |   NULL  |    NULL    |
| 2001-03-24 |   1    |    1    |  3600.0000 |    1    |  3663.0000 |
| 2001-03-24 |   2    |    2    |  1500.0000 |    1    |  3500.0000 |
| 2001-03-24 |   4    |    1    |  3400.0000 |   NULL  |     NULL   |
| 2001-03-24 |   3    |    2    |  1500.0000 |   NULL  |     NULL   |
| 2001-03-26 |   1    |   NULL  |    NULL    |    1    |  1221.0000 |
| 2001-03-28 |   1    |   NULL  |    NULL    |    1    |  2075.0000 |
| 2001-03-29 |   1    |   NULL  |    NULL    |    1    |  2004.0000 |
| 2001-03-29 |   2    |   NULL  |    NULL    |    2    |  7848.0000 |
| 2001-03-29 |   3    |   NULL  |    NULL    |    1    |  2006.0000 |
| 2001-04-02 |   1    |   NULL  |    NULL    |    2    |  2040.0000 |
| 2001-04-11 |   1    |   NULL  |    NULL    |    1    |  3195.0400 |
| 2001-04-13 |   1    |    1    |  5000.0000 |    1    |  4490.0000 |
| 2001-04-13 |   2    |    1    |  5000.0000 |   NULL  |    NULL    |
| 2001-04-27 |   1    |   NULL  |    NULL    |    1    |  3110.0000 |
| 2001-05-11 |   1    |    1    |  4500.0000 |    1    |  2530.0000 |
| 2001-09-13 |   1    |    3    |  1350.0000 |    3    |  1200.0000 |
| 2001-09-13 |   2    |    3    |  1750.0000 |    3    |  1500.0000 |
| 2001-09-14 |   1    |   NULL  |    NULL    |    3    |  1150.0000 |
+------------+--------+---------+------------+---------+------------+
