USE bank;

TRUNCATE TABLE Scores;

INSERT INTO Scores ([Account number], Owner, Balance)
VALUES ('111111111111', 'Ivanov', 1000),
       ('222222222222', 'Petrov', 0)
GO

SET NOCOUNT ON;

IF @@TRANCOUNT > 0 ROLLBACK;

SELECT 'До начала транзакции' AS 'Состояние',
       Owner,
       Balance,
       @@TRANCOUNT            AS 'Количество_транзакций',
       @@SPID                 AS 'Процесс'
FROM Scores
GO
+-----------------------+--------+------------+-----------------------+----------+
|        Состояние      | Owner  |  Balance   | Количество_транзакций |  Процесс |
+-----------------------+--------+------------+-----------------------+----------+
| До начала транзакции  | Ivanov |   1000.00  |          0            |     51   |
| До начала транзакции  | Petrov |      0.00  |          0            |     51   |
+-----------------------+--------+------------+-----------------------+----------+

-- АТОМАРНОСТЬ (atomicity).
BEGIN TRANSACTION перевод_денег
UPDATE Scores
SET Balance -= 500
WHERE Owner = 'Ivanov'

SELECT 'Транзакция после первого UPDATE' AS 'Состояние',
       Owner,
       Balance,
       @@TRANCOUNT                       AS 'Количество_транзакций',
       @@SPID                            AS 'Процесс'
FROM Scores
GO
+-----------------------+--------+------------+-----------------------+----------+
|        Состояние      | Owner  |  Balance   | Количество_транзакций |  Процесс |
+-----------------------+--------+------------+-----------------------+----------+
| До начала транзакции  | Ivanov |     500.00 |          1            |     51   |
| До начала транзакции  | Petrov |       0.00 |          1            |     51   |
+-----------------------+--------+------------+-----------------------+----------+

-- KILL 51 -- Отстанавливаем процесс транзакции из другого сеанса.

SELECT 'Транзакция после отстановки процесса' AS 'Состояние',
       Owner,
       Balance,
       @@TRANCOUNT                            AS 'Количество_транзакций',
       @@SPID                                 AS 'Процесс'
FROM Scores
GO
+---------------------------------------+--------+------------+-----------------------+----------+
|        Состояние                      | Owner  |  Balance   | Количество_транзакций |  Процесс |
+---------------------------------------+--------+------------+-----------------------+----------+
| Транзакция после отстановке процесса  | Ivanov |    1000.00 |          0            |     51   |
| Транзакция после отстановке процесса  | Petrov |       0.00 |          0            |     51   |
+---------------------------------------+--------+------------+-----------------------+----------+

-- SQL сервер автоматически откатывает транзакцию к начальному состоянию и частично транзакция не фиксируется.

-- СОГЛАСОВАННОСТЬ (consistency) - означает, что каждая успешная транзакция
-- по определению фиксирует только допустимые результаты.

-- Транзакция с автоматическим подтверждением AutoCommit Transaction
SET NOCOUNT ON;
IF @@TRANCOUNT > 0 ROLLBACK;

SELECT 'Состояние до транзакции' AS 'Состояние',
       Owner,
       Balance,
       @@TRANCOUNT               AS 'Количество_транзакций',
       @@SPID                    AS 'Процесс'
FROM Scores
GO
+---------------------------------------+--------+------------+-----------------------+----------+
|        Состояние                      | Owner  |  Balance   | Количество_транзакций |  Процесс |
+---------------------------------------+--------+------------+-----------------------+----------+
| Транзакция после отстановке процесса  | Ivanov |    1000.00 |          0            |     51   |
| Транзакция после отстановке процесса  | Petrov |       0.00 |          0            |     51   |
+---------------------------------------+--------+------------+-----------------------+----------+

-- Транзакция с автоматической фиксации.
UPDATE Scores
SET Balance =
        CASE Owner
            WHEN 'Ivanov' THEN Balance - 5000
            WHEN 'Petrov' THEN Balance + 5000
        END
WHERE Owner IN ('Ivanov', 'Petrov')

SELECT 'Состояние после транзакции' AS 'Состояние',
       Owner,
       Balance,
       @@TRANCOUNT               AS 'Количество_транзакций',
       @@SPID                    AS 'Процесс'
FROM Scores
GO
+---------------------------------------+--------+------------+-----------------------+----------+
|        Состояние                      | Owner  |  Balance   | Количество_транзакций |  Процесс |
+---------------------------------------+--------+------------+-----------------------+----------+
| Транзакция после отстановке процесса  | Ivanov |    1000.00 |          0            |     51   |
| Транзакция после отстановке процесса  | Petrov |       0.00 |          0            |     51   |
+---------------------------------------+--------+------------+-----------------------+----------+

-- ошибка выполнения транзакции:
-- 1. списывания денег, невозможно списать деньги со счета Иванова в заданном размере,
-- потому что данной суммый у него не имеется, что является нарушениям ограничений установленных при создании таблицы;
-- 2. вполнятеся откат транзакции, который обеспечивает её атомарность, что также является условием её согласованности.

SET NOCOUNT ON;
SET TRANSACTION ISOLATION LEVEL READ COMMITTED;

SELECT 'Состояние до транзакции' AS 'Состояние',
       Owner,
       Balance,
       @@TRANCOUNT               AS 'Количество_транзакций',
       @@SPID                    AS 'Процесс'
FROM Scores
GO

-- Транзакция с автоматической фиксации.
BEGIN TRANSACTION

UPDATE Scores
SET Balance -= 500
WHERE Owner = 'Ivanov'
GO

-- Проверка условий.
SELECT 'Транзакция после первого UPDATE'
                    AS 'Состояние',
       Owner,
       Balance,
       @@SPID       AS 'Процесс',
       @@TRANCOUNT  AS 'Количество_транзакций'
FROM Scores
GO

-- При открытой транзакции переход на второй сеанс.

UPDATE Scores
SET Balance += 500
WHERE Owner = 'Petrov'
GO

-- Проверка условий.
SELECT 'Транзакция после второго UPDATE'
                    AS 'Состояние',
       Owner,
       Balance,
       @@SPID       AS 'Процесс',
       @@TRANCOUNT  AS 'Количество_транзакций'
FROM Scores
GO

ROLLBACK TRANSACTION;
