/*
Задача 16.
Найдите пары моделей PC, имеющих одинаковые скорость и RAM.
В результате каждая пара указывается только один раз, т.е. (i,j), но не (j,i).
Порядок вывода: модель с большим номером, модель с меньшим номером, скорость и RAM.
 */

USE computer;

-- 1 способ решение с помощью фильтра WHERE.
SELECT DISTINCT p1.model, p2.model, p1.speed, p1.ram
FROM PC AS p1,
     PC AS p2
WHERE p1.speed = p2.speed
  AND p1.ram = p2.ram
  AND p1.model > p2.model
GO
+------------+------------+------------+------------+
|  p1.model  |  p2.model  |   speed    |    ram     |
+------------+------------+------------+------------+
|    1233    |    1121    |     750    |    128     |
|    1233    |    1232    |     500    |     64     |
|    1260    |    1232    |     500    |     32     |
+------------+------------+------------+------------+

-- 2 способ решение с помощью JOIN.
SELECT DISTINCT pc1.model, pc2.model, pc1.speed, pc2.ram
FROM PC pc1
    JOIN PC pc2
        ON pc1.ram = pc2.ram
               AND pc1.speed = pc2.speed
               AND pc1.model > pc2.model
GO
+------------+------------+------------+------------+
|  p1.model  |  p2.model  |   speed    |    ram     |
+------------+------------+------------+------------+
|    1233    |    1121    |     750    |    128     |
|    1233    |    1232    |     500    |     64     |
|    1260    |    1232    |     500    |     32     |
+------------+------------+------------+------------+
